app/controllers/equipment_controller.rb

  def index
    #    @positions = Position.find(:all)
    @positions = Position.find_by_params(params)
    @total_count = Position.count(:all)
---
SELECT count(*) AS count_all FROM `positions`